
[DESC]
1=Two-Face has stolen something belonging to Catwoman. She wants it back.
2=With the plans retrieved, Catwoman needs to convince Poison Ivy to help her break into Hugo Strange's Confiscated Goods Vault.
3=Poison Ivy has smashed open an underground tunnel into the Confiscated Goods Vault. Now, Catwoman needs to take on the elite TYGER guards to pull off the heist of a lifetime.
4=With Batman saved, it's time to leave Arkham City, once and for all...
Locked=Unlock this episode by playing the story mode.
